[
    {
        "Stock Portfolio Dashboard": {
            "title": "Stock Market Portfolio Software",
            "description": "Enhance your portfolio decision-making by transforming historical data into actionable insights. This autonomous software leverages advanced statistical and machine learning models to optimize return and manage risk, all through an intuitive and user-friendly interface.",
            "tech_used": {
                "programming_languages": {
                    "python": {
                        "libraries_used": {
                            "yfinance": "Provides functionality for accessing and retrieving historical market data from Yahoo Finance.",
                            "pandas": "Utilized for data manipulation and analysis, particularly for working with data frames.",
                            "numpy": "Essential for performing numerical operations and matrix manipulations.",
                            "scipy": "Applied for advanced statistical analysis and scientific computations.",
                            "plotly": "Used for creating interactive and visually appealing plots and charts.",
                            "dash": "Framework for building and deploying interactive web applications with a focus on data visualization."
                        }
                    }
                }
            },
            "version": "1.0",
            "requirements": "Having the latest Python version, and preferably running on VSCode.",
            "features": [
                "Real-time portfolio performance tracking",
                "Historical data analysis and visualization",
                "Advanced statistical and machine learning models for risk and return optimization",
                "User-friendly interactive dashboard interface"
            ],
            "usage_steps": {
                "1": "Clone the Repository: Use the command `git clone https://github.com/PPuertos/Stock-Market-Dashboard.git` to obtain a local copy of the project repository.",
                "2": "Install Required Libraries: Ensure that all necessary libraries are installed by running `pip install -r requirements.txt` in your command line or terminal, where `requirements.txt` lists all the dependencies.",
                "3": "Run the Main Script: Execute the main script to start the application. This can typically be done using the command `python main_script.py`, where `main_script.py` is the entry point of the application.",
                "4": "Search Markets and Stocks: Once the application is running, you can search for specific markets and stocks through the provided interface.",
                "5": "Explore Analysis Sections: Navigate through the various sections of the application to access and review different analyses that aid in decision-making.",
                "result": "By following these steps, you will be able to fully utilize the features of the project and benefit from its analytical capabilities."
            },
            "value_proposition": "This dashboard allows users to monitor and analyze their stock portfolios by visualizing historical performance and leveraging predictive models to enhance decision-making. It integrates various data sources and provides actionable insights to optimize portfolio returns and manage risks effectively.",
            "site_link": "http://127.0.0.1:3000/index.html"
        },
        "Logistics Dashboard": {
            "title": "Transportation Logistics Cost",
            "description": "Leverage data-driven insights to optimize transportation logistics. This autonomous dashboard is designed to track and analyze the costs associated with all routes for trailers, enabling the evaluation of route feasibility and enhancing business intelligence.",
            "tech_used": {
                "programming_languages": {
                    "python": {
                        "libraries_used": {
                            "INEGIpy": "Extracts route (GEOJSON format), freight and diesel cost data.",
                            "pandas": "Facilitates data manipulation and analysis.",
                            "plotly": "Creates interactive visualizations and plots. Dash module powers the web-based dashboard interface.",
                            "follium": "Displays routes on a map."
                        }
                    }
                }
            },
            "version": "1.0",
            "requirements": "Ensure you have the latest version of Python installed. It is recommended to run the application in Visual Studio Code (VSCode) for optimal performance.",
            "features": {
                "Visualize":"Visualization of routes on an interactive map.",
                "Analyse":"Cost analysis panel by route.",
                "Get Insights":"Business intelligence plots for in-depth data insights.",
                "Easy to Use":"User-friendly interface for seamless navigation."
            },
            "usage_steps": {
                "1": "Clone the Repository: Obtain a local copy of the project repository using the command `git clone https://github.com/PPuertos/Dashboard-Logistica.git`.",
                "2": "Install Required Libraries: Install all necessary libraries by running `pip install -r requirements.txt`. This command ensures that all dependencies listed in `requirements.txt` are installed.",
                "3": "Run the Main Script: Start the application by executing the main script with `python src/app.py`. Here, `app.py` serves as the entry point for the application.",
                "4": "Explore the Dashboard: Access the dashboard via your web browser to interact with the map, cost panels, and business intelligence plots.",
                "5": "Customize Data (Optional): To use your own data, create a CSV file with the columns `[trailer_id, destination]` and replace the existing data file as needed.",
                "result": "After completing the setup, you will be able to visualize and analyze transportation routes and associated costs, providing valuable insights into route feasibility and cost efficiency."
            },
            "value_proposition": "This dashboard integrates various data sources and visualization tools to offer a comprehensive view of transportation logistics, helping to drive informed decision-making and optimize logistics operations.",
            "site_link": "http://127.0.0.1:3000/index.html"
        },
        "Personal Finances Dashboard": {
            "title": "Personal Finances Tracking Report",
            "description": "Optimize your personal financial management. This dashboard offers a comprehensive view of your finances by comparing monthly income, expenses, and utilities against your goals and budgets. It helps you track your financial health through detailed visualizations of your total balance in relation to your goals and budget.",
            "tech_used": {
                "programming_languages": {
                    "Dax": "Used for advanced data manipulation and calculations within Power BI."
                },
                "business_intelligence_software": "Power BI"
            },
            "version": "1.0",
            "requirements": "Ensure you have Power BI Desktop or access to Power BI via the web.",
            "features": [
                "Income vs Goals: Compares your actual monthly income with your financial goals, helping you monitor your progress and identify shortfalls.",
                "Expenses vs Budget: Tracks your actual monthly expenses against your budget to highlight areas of overspending and opportunities for adjustment.",
                "Utilities vs Expected Utilities: Evaluates your actual utility costs each month compared to expected values, ensuring you remain within your planned limits.",
                "Total Balance vs Expected Balance: Shows the comparison between your actual total balance and your expected balance, providing a snapshot of your overall financial health.",
                "Monthly Comparisons: Provides a detailed comparison of income, expenses, and utilities on a monthly basis to facilitate thorough financial analysis.",
                "Categorized Panels: Each financial aspect is organized into distinct categories for streamlined analysis and easy navigation.",
                "Interactive BI Plots: Utilizes Power BI's interactive plots and charts to enhance data visualization and enable users to identify discrepancies between actual performance and expected values."
            ],
            "usage_steps": {
                "1": "Access the Dashboard: Visit the provided link to open the personal finance dashboard with sample data.",
                "2": "Explore Panels: Navigate through various panels to view and analyze monthly comparisons of income, expenses, utilities, and total balance.",
                "3": "Interact with Visualizations: Use interactive elements to delve deeper into your financial data and understand areas where you may not be meeting your goals.",
                "4": "Analyze Results: Review the visualizations to identify categories and months where financial performance differs from expectations, and take action to improve financial management.",
                "result": "Obtain a comprehensive view of your financial status, with detailed monthly comparisons and visual insights, allowing for better financial decision-making.",
                "optional": "Currently, a personal use version is not available, but updates will be provided in the future."
            },
            "value_proposition": "The Personal Finances Dashboard leverages Power BI’s advanced capabilities to offer a thorough and interactive overview of your financial data. By comparing monthly figures against your goals and budgets, it provides valuable insights into your financial performance, helping you make informed decisions and better manage your finances.",
            "site_link": "http://127.0.0.1:3000/index.html"
        },
        "Portfolio Website": {
            "title": "Personal Portfolio Website",
            "description": "A personal portfolio website designed to showcase my work, visions, goals, and interests, with the aim of potential collaboration opportunities.",
            "tech_used": {
                "programming_languages": {
                    "HTML": "Used for website structure.",
                    "CSS": {
                        "usage": "Applied for website styling.",
                        "framework": "Bootstrap 5"
                    },
                    "JavaScript": "Utilized for user interactivity."
                }
            },
            "version": "1.0",
            "requirements": "Accessible through any modern web browser.",
            "features": [
                "About Me: Detailed information about my vision, passion, and professional background.",
                "Skills: A comprehensive list of hard skills (programming languages, mathematical and statistical knowledge) and soft skills (adaptability, problem-solving, work ethic).",
                "Personal Overview: Insights into my current employment, studies, age, and career trajectory.",
                "My Work: A showcase of my personal projects, including detailed descriptions and relevant information.",
                "Experience: A record of my job experiences and accomplishments.",
                "Contact Details: My contact details for reaching out.",
                "Collaborate with Me: A section for visitors to provide their information for potential collaboration opportunities."
            ],
            "value_proposition": "The website aims to provide a comprehensive overview of my professional profile and facilitate connections for collaboration.",
            "site_link": "http://127.0.0.1:3000/index.html"
        }
    }
]